# CoreElemTestingError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeneralFailures..::..CoreElemTestingError Property
BuiltInFailures..::..GeneralFailures Class See Also
---
Core element testing error (internal).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CoreElemTestingError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CoreElemTestingError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CoreElemTestingError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeneralFailures Class
Autodesk.Revit.DB Namespace